HomeMoney.ДомашняяБухгалтерияДополнение/src/Documents/ДБ_ПоказанияСчетчиков/ДБ_ПоказанияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДБ_ПоказанияСчетчиков</name>
  <registerRecords>AccumulationRegister.ДБ_ПоказанияСчетчиков</registerRecords>
  <attributes>
    <name>Имущество</name>
    <type>
      <types>CatalogRef.Имущество</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показания</name>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.ДБ_Счетчики</types>
      </type>
    </attributes>
    <attributes>
      <name>Показание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeMoney.ДомашняяБухгалтерияДополнение/src/AccumulationRegisters/ДБ_ПоказанияСчетчиков/ДБ_ПоказанияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДБ_ПоказанияСчетчиков</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Имущество</name>
    <type>
      <types>CatalogRef.Имущество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.ДБ_Счетчики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

HomeMoney.ДомашняяБухгалтерияДополнение/src/Documents/ДБ_ПоказанияСчетчиков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДБ_ПоказанияСчетчиков 
	Движения.ДБ_ПоказанияСчетчиков.Записывать = Истина;
	Для Каждого ТекСтрокаПоказания Из Показания Цикл
		Движение = Движения.ДБ_ПоказанияСчетчиков.Добавить();
		Движение.Период = Дата;
		Движение.Имущество = Имущество;
		Движение.Счетчик = ТекСтрокаПоказания.Счетчик;
		Движение.Количество = ТекСтрокаПоказания.Показание;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
